app/views/pages/profile.html.erb

            <div class="col-sm-11">
              <p class="post-title"><span class="post-owner"><a href="/user/<%= User.find(@p.user_id).username %>"><%= User.find(@p.user_id).username %></a></span> <span class="post-creation">- <%= @p.created_at.to_formatted_s(:short) %></span></p>
---
SELECT "posts".* FROM "posts" WHERE (user_id = 5) ORDER BY "posts"."created_at" DESC
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]

    <div class="col-xs-3">
        <%= render '/components/follow_button', :user => User.find_by_username(params[:id]) %>
---
SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "Austin"], ["LIMIT", 1]]