app/controllers/pages_controller.rb

SELECT "posts".* FROM "posts" WHERE (user_id IN (NULL)) ORDER BY "posts"."created_at" DESC
---
  def home
    @posts = Post.all

SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "username"], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE (user_id = 5) ORDER BY "posts"."created_at" DESC
---
  def profile
    # grab the username from the URL as :id
    if (User.find_by_username(params[:id]))
      @username = params[:id]
    else
      # redirect to 404 (root for now)
      redirect_to root_path, :notice=> "User not found!"
    end

    @posts = Post.all.where("user_id = ?", User.find_by_username(params[:id]))